engineer-ae3o/stm32-hal-library/components/drivers/spi.h
#ifndef SPI_H_
#define SPI_H_


#ifdef __cplusplus
extern "C" {
#endif


#include "stm32f411xe.h"
#include "drivers/dma_types.h"
#include "drivers/gpio.h"
#include "utils/board.h"
#include "utils/err.h"

#include <stddef.h>
#include <stdint.h>


typedef enum : uint8_t {
    SPI_PRESCALER_DIV2,
    SPI_PRESCALER_DIV4,
    SPI_PRESCALER_DIV8,
    SPI_PRESCALER_DIV16,
    SPI_PRESCALER_DIV32,
    SPI_PRESCALER_DIV64,
    SPI_PRESCALER_DIV128,
    SPI_PRESCALER_DIV256,
} spi_prescaler_t;

typedef enum : uint8_t {
    SPI_DATA_8_BITS,
    SPI_DATA_16_BITS,
} spi_data_size_t;

typedef struct {
    bool cpol;
    bool cpha;

    bool use_miso;
    bool use_mosi;

    spi_data_size_t data_size;
    spi_prescaler_t prescaler;

    board_pin_t miso_pin;
    board_pin_t mosi_pin;
    board_pin_t sclk_pin;
} spi_master_config_t;

// General API
hal_err_t spix_clk_enable(SPI_TypeDef* handle, bool enable);
hal_err_t spi_master_init(SPI_TypeDef* handle, const spi_master_config_t* config);
hal_err_t spi_master_deinit(SPI_TypeDef* handle);
hal_err_t spi_master_dma_init(SPI_TypeDef* handle, dma_priority_t priority);
hal_err_t spi_master_dma_deinit(SPI_TypeDef* handle);

// Polling API
hal_err_t spi_master_transmit_poll(SPI_TypeDef* handle, const void* data, size_t size);
hal_err_t spi_master_receive_poll(SPI_TypeDef* handle, void* data, size_t size);
hal_err_t spi_master_transceive_poll(SPI_TypeDef* handle, const void* tx_data, void* rx_data, size_t size);

// DMA transfer API
hal_err_t spi_master_transmit_dma(SPI_TypeDef* handle, const void* data, uint16_t size, dma_done_cb_t cb, void* arg);
hal_err_t spi_master_receive_dma(SPI_TypeDef* handle, void* data, uint16_t size, dma_done_cb_t cb, void* arg);
hal_err_t spi_master_transceive_dma(SPI_TypeDef* handle, const void* tx_data, void* rx_data, uint16_t size, dma_done_cb_t cb, void* arg);


#ifdef __cplusplus
}
#endif


#endif // SPI_H_